BenchBnB/bench_bnb/app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "hank"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Joe"], ["password_digest", "$2a$12$PzG1GTFlsxUzdbA./.l65uT0gr.aFqOyi2BHL4Gcf6pyUJVRaVAo2"], ["session_token", "3F9RXixReL2Qo41JhO53Vx69qjDqKCIZj4pgmYctM6U"]]
---
  def create
    @user = User.new(user_params)

    if User.find_by(username: user_params[:username])
        render json: @user.errors.full_messages, status: 401
    elsif @user.save