BenchBnB/bench_bnb/app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "AjtIDkdu_z7BUG9Q2OZ3Rn73ZKk0JUAmpF0HNzslQGk"], ["LIMIT", 1]]