BenchBnB/bench_bnb/app/models/user.rb

    def self.find_by_credentials(username, password)
        user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "hank"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(32)
        self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "Cgn0GKhHzuUS3CqQWhynV8ot602jgGGBBapCAHsDm9o"], ["id", 7]]